tests/Omnipay/Eway/Mock/RapidPurchaseRequestFailure.txt

HTTP/1.1 200 OK
Cache-control: no-cache="set-cookie"
Content-Type: application/json; charset=utf-8
Date: Thu, 27 Jun 2013 05:22:52 GMT
Set-Cookie: AWSELB=8361C96B088FEBBC7D3ABDFE8BA0FF6501B9705E7D00F53B19AA8D0E66C1AD34691F2170CBA3CC4FEE8666E2FB3C85D3B0E238FA2E93B31AAC1C98DFF4D0639139359FE706;PATH=/;MAX-AGE=86400
X-EWAY-VIA: api-au.sandbox.ewaypayments.com/
X-EWAY-VIA-FROM: http://api.sandbox.ewaypayments.com/CreateAccessCode.json
X-EWAY-VIA-HTTP-METHOD: POST
X-EWAY-VIA-HTTP-STATUS: 200
X-EWAY-VIA-TO: http://api-au.sandbox.ewaypayments.com/CreateAccessCode.json
X-ID: AM-131
X-Powered-By: eWAY
X-Staging: AU
Content-Length: 649
Connection: keep-alive

{"AccessCode":null,"Customer":{"TokenCustomerID":null,"Reference":null,"Title":null,"FirstName":null,"LastName":null,"CompanyName":null,"JobDescription":null,"Street1":null,"Street2":null,"City":null,"State":null,"PostalCode":null,"Country":null,"Email":null,"Phone":null,"Mobile":null,"Comments":null,"Fax":null,"Url":null,"CardNumber":null,"CardStartMonth":null,"CardStartYear":null,"CardIssueNumber":null,"CardName":null,"CardExpiryMonth":null,"CardExpiryYear":null,"IsActive":false},"Payment":{"TotalAmount":-1000,"InvoiceNumber":null,"InvoiceDescription":null,"InvoiceReference":null,"CurrencyCode":"AUD"},"FormActionURL":null,"Errors":"V6011"}
