tests/Omnipay/Eway/Mock/RapidPurchaseRequestSuccess.txt

HTTP/1.1 200 OK
Cache-control: no-cache="set-cookie"
Content-Type: application/json; charset=utf-8
Date: Wed, 26 Jun 2013 13:11:50 GMT
Set-Cookie: AWSELB=8361C96B088FEBBC7D3ABDFE8BA0FF6501B9705E7D00F53B19AA8D0E66C1AD34691F2170CB4C6B4D750DDAD028ED5C0787DEB1569F57CC58B5923AA0229EC5B49BD7647A57;PATH=/;MAX-AGE=86400
X-EWAY-VIA: api-au.sandbox.ewaypayments.com/
X-EWAY-VIA-FROM: http://api.sandbox.ewaypayments.com/CreateAccessCode.json
X-EWAY-VIA-HTTP-METHOD: POST
X-EWAY-VIA-HTTP-STATUS: 200
X-EWAY-VIA-TO: http://api-au.sandbox.ewaypayments.com/CreateAccessCode.json
X-ID: AM-143
X-Powered-By: eWAY
Content-Length: 774
Connection: keep-alive

{"AccessCode":"F9802j0-O7sdVLnOcb_3IPryTxHDtKY8u_0pb10GbYq-Xjvbc-5Bc_LhI-oBIrTxTCjhOFn7Mq-CwpkLDja5-iu-Dr3DjVTr9u4yxSB5BckdbJqSA4WWydzDO0jnPWfBdKcWL","Customer":{"TokenCustomerID":null,"Reference":"","Title":"","FirstName":"","LastName":"","CompanyName":"","JobDescription":"","Street1":"","Street2":"","City":"","State":"","PostalCode":"","Country":"","Email":"","Phone":"","Mobile":"","Comments":"","Fax":"","Url":"","CardNumber":"","CardStartMonth":"","CardStartYear":"","CardIssueNumber":"","CardName":"","CardExpiryMonth":"","CardExpiryYear":"","IsActive":false},"Payment":{"TotalAmount":1000,"InvoiceNumber":null,"InvoiceDescription":null,"InvoiceReference":null,"CurrencyCode":"AUD"},"FormActionURL":"https://secure-au.sandbox.ewaypayments.com/Process","Errors":null}
